/* automatically generated by rust-bindgen */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const SOAPY_SDR_TX: u32 = 0;
pub const SOAPY_SDR_RX: u32 = 1;
pub const SOAPY_SDR_END_BURST: u32 = 2;
pub const SOAPY_SDR_HAS_TIME: u32 = 4;
pub const SOAPY_SDR_END_ABRUPT: u32 = 8;
pub const SOAPY_SDR_ONE_PACKET: u32 = 16;
pub const SOAPY_SDR_MORE_FRAGMENTS: u32 = 32;
pub const SOAPY_SDR_WAIT_TRIGGER: u32 = 64;
pub const SOAPY_SDR_TIMEOUT: i32 = -1;
pub const SOAPY_SDR_STREAM_ERROR: i32 = -2;
pub const SOAPY_SDR_CORRUPTION: i32 = -3;
pub const SOAPY_SDR_OVERFLOW: i32 = -4;
pub const SOAPY_SDR_NOT_SUPPORTED: i32 = -5;
pub const SOAPY_SDR_TIME_ERROR: i32 = -6;
pub const SOAPY_SDR_UNDERFLOW: i32 = -7;
pub const __GNUC_VA_LIST: u32 = 1;
pub const SOAPY_SDR_CF64: &'static [u8; 5usize] = b"CF64\0";
pub const SOAPY_SDR_CF32: &'static [u8; 5usize] = b"CF32\0";
pub const SOAPY_SDR_CS32: &'static [u8; 5usize] = b"CS32\0";
pub const SOAPY_SDR_CU32: &'static [u8; 5usize] = b"CU32\0";
pub const SOAPY_SDR_CS16: &'static [u8; 5usize] = b"CS16\0";
pub const SOAPY_SDR_CU16: &'static [u8; 5usize] = b"CU16\0";
pub const SOAPY_SDR_CS12: &'static [u8; 5usize] = b"CS12\0";
pub const SOAPY_SDR_CU12: &'static [u8; 5usize] = b"CU12\0";
pub const SOAPY_SDR_CS8: &'static [u8; 4usize] = b"CS8\0";
pub const SOAPY_SDR_CU8: &'static [u8; 4usize] = b"CU8\0";
pub const SOAPY_SDR_CS4: &'static [u8; 4usize] = b"CS4\0";
pub const SOAPY_SDR_CU4: &'static [u8; 4usize] = b"CU4\0";
pub const SOAPY_SDR_F64: &'static [u8; 4usize] = b"F64\0";
pub const SOAPY_SDR_F32: &'static [u8; 4usize] = b"F32\0";
pub const SOAPY_SDR_S32: &'static [u8; 4usize] = b"S32\0";
pub const SOAPY_SDR_U32: &'static [u8; 4usize] = b"U32\0";
pub const SOAPY_SDR_S16: &'static [u8; 4usize] = b"S16\0";
pub const SOAPY_SDR_U16: &'static [u8; 4usize] = b"U16\0";
pub const SOAPY_SDR_S8: &'static [u8; 3usize] = b"S8\0";
pub const SOAPY_SDR_U8: &'static [u8; 3usize] = b"U8\0";
pub const SOAPY_SDR_API_VERSION: u32 = 458752;
pub const SOAPY_SDR_ABI_VERSION: &'static [u8; 4usize] = b"0.7\0";
pub type wchar_t = ::std::os::raw::c_ushort;
pub type max_align_t = f64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SoapySDRRange {
    pub minimum: f64,
    pub maximum: f64,
    pub step: f64,
}
#[test]
fn bindgen_test_layout_SoapySDRRange() {
    assert_eq!(
        ::std::mem::size_of::<SoapySDRRange>(),
        24usize,
        concat!("Size of: ", stringify!(SoapySDRRange))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRRange>())).minimum as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRRange),
            "::",
            stringify!(minimum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRRange>())).maximum as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRRange),
            "::",
            stringify!(maximum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRRange>())).step as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRRange),
            "::",
            stringify!(step)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SoapySDRKwargs {
    pub size: usize,
    pub keys: *mut *mut ::std::os::raw::c_char,
    pub vals: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SoapySDRKwargs() {
    assert_eq!(
        ::std::mem::size_of::<SoapySDRKwargs>(),
        12usize,
        concat!("Size of: ", stringify!(SoapySDRKwargs))
    );
    assert_eq!(
        ::std::mem::align_of::<SoapySDRKwargs>(),
        4usize,
        concat!("Alignment of ", stringify!(SoapySDRKwargs))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRKwargs>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRKwargs),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRKwargs>())).keys as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRKwargs),
            "::",
            stringify!(keys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRKwargs>())).vals as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRKwargs),
            "::",
            stringify!(vals)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_SoapySDRKwargs_fromString"]
    pub fn SoapySDRKwargs_fromString(markup: *const ::std::os::raw::c_char) -> SoapySDRKwargs;
}
extern "C" {
    #[link_name = "\u{1}_SoapySDRKwargs_toString"]
    pub fn SoapySDRKwargs_toString(args: *const SoapySDRKwargs) -> *mut ::std::os::raw::c_char;
}
pub const SoapySDRArgInfoType_SOAPY_SDR_ARG_INFO_BOOL: SoapySDRArgInfoType = 0;
pub const SoapySDRArgInfoType_SOAPY_SDR_ARG_INFO_INT: SoapySDRArgInfoType = 1;
pub const SoapySDRArgInfoType_SOAPY_SDR_ARG_INFO_FLOAT: SoapySDRArgInfoType = 2;
pub const SoapySDRArgInfoType_SOAPY_SDR_ARG_INFO_STRING: SoapySDRArgInfoType = 3;
pub type SoapySDRArgInfoType = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SoapySDRArgInfo {
    pub key: *mut ::std::os::raw::c_char,
    pub value: *mut ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
    pub description: *mut ::std::os::raw::c_char,
    pub units: *mut ::std::os::raw::c_char,
    pub type_: SoapySDRArgInfoType,
    pub range: SoapySDRRange,
    pub numOptions: usize,
    pub options: *mut *mut ::std::os::raw::c_char,
    pub optionNames: *mut *mut ::std::os::raw::c_char,
    pub __bindgen_padding_0: u32,
}
#[test]
fn bindgen_test_layout_SoapySDRArgInfo() {
    assert_eq!(
        ::std::mem::size_of::<SoapySDRArgInfo>(),
        64usize,
        concat!("Size of: ", stringify!(SoapySDRArgInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRArgInfo>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRArgInfo>())).value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRArgInfo>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRArgInfo>())).description as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRArgInfo>())).units as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(units)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRArgInfo>())).type_ as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRArgInfo>())).range as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRArgInfo>())).numOptions as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(numOptions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRArgInfo>())).options as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SoapySDRArgInfo>())).optionNames as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(optionNames)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_SoapySDRStrings_clear"]
    pub fn SoapySDRStrings_clear(elems: *mut *mut *mut ::std::os::raw::c_char, length: usize);
}
extern "C" {
    #[link_name = "\u{1}_SoapySDRKwargs_set"]
    pub fn SoapySDRKwargs_set(
        args: *mut SoapySDRKwargs,
        key: *const ::std::os::raw::c_char,
        val: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_SoapySDRKwargs_get"]
    pub fn SoapySDRKwargs_get(
        args: *mut SoapySDRKwargs,
        key: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_SoapySDRKwargs_clear"]
    pub fn SoapySDRKwargs_clear(args: *mut SoapySDRKwargs);
}
extern "C" {
    #[link_name = "\u{1}_SoapySDRKwargsList_clear"]
    pub fn SoapySDRKwargsList_clear(args: *mut SoapySDRKwargs, length: usize);
}
